* Barnes_T0975_1976

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Barnes_T0975_1976
Place name                       | Barnes Ice Cap
Geographic location              | Canadian Arctic South
Ice type                         | Ice cap
Data Source                      | Graphic in science source
Data DOI                         | 
Science Source                   | Hooke, Roger LeB., Alexander, E. Calvin, Gustafson, Robert J.: Temperature profiles in the Barnes Ice Cap, Baffin Island, Canada, and heat flux from the subglacial terrane , Canadian Journal of Earth Sciences 17(9), Canadian Science Publishing, 1174–1188, sep 1980
Science DOI                      | 10.1139/e80-124
Date                             | 1976-06-22
Longitude [°E]                   | -72.1103
Latitude [°N]                    | 69.79795
Location Source                  | Location digitized by M. Jacquemart from Gilbert (2016)
Depth of top measurement [m]     | 0.0
Depth of bottom measurement [m]  | 47
Ice thickness [m]                | 115
Coverage [% of thickness]        | 41
Ice thickness source             | See science source
Note                             | "Date is ""Date completed"" from Hooke (1980) Table 1 Column 2 + Days to final measurement (Column 3); Temperature and location digitized by M. Jacquemart from Gilbert (2016)"
#+end_example


** Temperature

+ Any notes on source or data
+ Links to key papers

** Thickness

+ Notes on thickness
 
** Location

+ Notes on location

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
(head -n1 data.csv && tail -n +2 data.csv | sort -t, -n -k2)
#+END_SRC

#+RESULTS: ingest_data
|          t |         d |
| -10.746013 |         0 |
|  -10.27362 | 23.785927 |
|  -9.887116 | 46.977203 |


